stream_template_cepartifacts/cepconfig/src/main/taskconfig/api__deploy__tenant__sensor__stream__addTaskDescription.xml

<@pp.dropOutputFile />
<#if source.type=="Feed Tweet">
<@pp.changeOutputFile
name="api__deploy__"+tenant.code+"__"+source.code_+"_"+stream.code+"__addTaskDescription.xml"/>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:addTaskDescription>
         <!--Optional:-->
              <task:task xmlns:task="http://www.wso2.org/products/wso2commons/tasks" name="TaskTwitter_${tenant.code}_${source.code}_${stream.code}" class="org.apache.synapse.startup.tasks.MessageInjector" group="synapse.simple.quartz" >
               <task:trigger count="-1" interval="${5*twitterInfo.twtMaxStreamsOfVE+1}"/>
               <task:property name="sequenceName" value="twitterInvokerSequence" xmlns="http://ws.apache.org/ns/synapse"/>
               <task:property name="message" xmlns="http://ws.apache.org/ns/synapse">
                <twit:invokeTwitter xmlns:twit="http://twitterpoller.yucca.csi.org" xmlns:xsd="http://dto.twitterpoller.yucca.csi.org/xsd"> 
		         <twit:twitterQuery> 
		            <xsd:twtGeolocLat>${twitterInfo.twtGeolocLat}</xsd:twtGeolocLat> 
		            <xsd:twtGeolocLon>${twitterInfo.twtGeolocLon}</xsd:twtGeolocLon> 
		            <xsd:twtGeolocRadius>${twitterInfo.twtGeolocRadius}</xsd:twtGeolocRadius> 
		           <#if twitterInfo.twtGeolocUnit=="null">
		            <xsd:twtGeolocUnit></xsd:twtGeolocUnit> 
<#else>		             
		            <xsd:twtGeolocUnit>${twitterInfo.twtGeolocUnit}</xsd:twtGeolocUnit> 
</#if>		            
<#if twitterInfo.twtLang=="null">
		            <xsd:twtLang></xsd:twtLang>
<#else>		             
					<xsd:twtLang>${twitterInfo.twtLang}</xsd:twtLang>
</#if>		            
		            <xsd:twtQuery>${twitterInfo.twtQuery}</xsd:twtQuery> 
<#if twitterInfo.twtResultType=="null">
		            <xsd:twtResultType></xsd:twtResultType> 
<#else>		             
		            <xsd:twtResultType>${twitterInfo.twtResultType}</xsd:twtResultType> 
</#if>		            
		            <xsd:twtTokenSecret>${twitterInfo.twtTokenSecret}</xsd:twtTokenSecret> 
<#if twitterInfo.twtUntil=="null">
		            <xsd:twtUntil></xsd:twtUntil> 
<#else>		             
		            <xsd:twtUntil>${twitterInfo.twtUntil}</xsd:twtUntil> 
</#if>		            
		            <xsd:twtUserToken>${twitterInfo.twtUserToken}</xsd:twtUserToken> 
		         </twit:twitterQuery> 
		         <twit:streamInfo> 
		            <xsd:streamCode>${stream.code}</xsd:streamCode> 
		            <xsd:tenatcode>${tenant.code}</xsd:tenatcode> 
		            <xsd:virtualEntityCode>${source.code}</xsd:virtualEntityCode>
		            <xsd:streamVersion>${stream.version}</xsd:streamVersion> 
		            <xsd:resetLastId>1</xsd:resetLastId>  
		         </twit:streamInfo> 
		        </twit:invokeTwitter> 
               </task:property>
               <task:property name="injectTo" value="sequence" xmlns="http://ws.apache.org/ns/synapse"/>
            </task:task>
      </xsd:addTaskDescription>
   </soapenv:Body>
</soapenv:Envelope>
</#if>